{"data":{"dataJson":{"articles":[{"description":null,"id":"schedule0","name":"Открытие дверей"},{"description":null,"id":"schedule1","name":"Церемония открытия"},{"description":null,"id":"schedule2","name":"Перерыв"},{"description":null,"id":"schedule3","name":"Обед"},{"description":null,"id":"schedule4","name":"Перерыв"},{"description":null,"id":"schedule5","name":"BeerJS"},{"description":"Что такое консоль? Текстовый терминал или уже полноценный интерфейс? Как можно затащить в консоль целый мессенджер и использовать его отовсюду. И как это может помочь вашим коллегам. В докладе расскажу, как можно создавать сложные или простые, но доступные консольные интерфейсы. Что такое доступность и кроссплатформенность в среде терминалов. И почему коллеги обычно не горят желанием пользоваться CLI.","id":"alexander_korotaev","name":"Как запустить Telegram в VS Code"},{"description":"2019 год, современный веб, PWA, SPA, bundle на фронте от одного мегабайта javascript. Стоп! Мы перестали ставить в приоритет экономию трафика и TTI пользователей, как делали это раньше. Пришло время разобраться в техниках оптимизации размера JS/CSS/IMAGE. Это битва за байты и мы ее начинаем.","id":"dmitry_patsura","name":"Optimize the size of your SPA, битва за байты"},{"description":"Мы рассмотрим преимущества и недостатки функциональных шаблонов, сравним их с декларативными и попытаемся найти способ преобразовать одни в другие без дополнительного оверхэда для разработчиков.","id":"alexander_kanunnikov","name":"JSX в декларативные шаблоны с помощью AST"},{"description":"Уже не помню, когда первый раз услышал термин continuous integration. С тех пор мир поменялся. Неизменным осталось только одно. Нам нужно больше автоматизации. Мой рассказ о том, как добавить в свою сборку нечто большее, чем запуск mocha и webpack.","id":"alexey_zolotyh","name":"Автоматизируй это. Гиперавтоматизированный пайплайн"},{"description":"Разберем существующие решения для прототипирования, напишем бэкенд и фронтенд для них. В докладе будут рассмотрены такие решения как Hasura, Prisma, pRest, Firebase, и конечно подключим динамичные формы и таблицы.","id":"rustam_imaykin","name":"Как делать быстро прототипы приложений на современных технологиях"},{"description":"Надоело терпеть дизайнерский беспредел на проекте? Кто в ответе за постоянно меняющиеся требования имплементации вашего приложения? Устали пилить велосипеды, которые никому по итогу не нужны? Давайте попробуем найти ту самую серебряную пулю, которая за раз решит все эти (и не только эти) проблемы.","id":"paul_yuhnovich","name":"Holy War between Designers & Developers"},{"description":"Для того, чтобы ответить на вопрос, на каком этапе развития сейчас находится технология Node.js, насколько она популярна, как часто становится выбором использования в production, какие преимущества она дает и с какими трудностями инженеры при использовании сталкивались, я сделаю хронологический рассказ, основанный на моем опыте, где поэтапно расскажу истории, объясняющие причины, следствия и вектор развития технологии.","id":"nikolay_matvienko","name":"Хроники Node.js: сообщество и корпорации"},{"description":"В больших проектах наступают моменты, когда сложность растет и предметная область перестает помещаться в голове. В такие моменты лучше не допускать беспорядка в данных и в коде. В одном из наших проектов мы боролись с беспорядком методом \"очистительного графкуэля\". Я хочу рассказать об этом поподробнее, ответив на следующие вопросы: Почему GraphQL многое упрощает? Что это вообще такое? Как готовить GraphQL-фронтенд? Как GraphQL может улучшить коммуникацию в команде?","id":"polina_gurtovaya","name":"GraphQL - уменьшаем энтропию"},{"description":"Расскажу о том, что нового произошло со Vue за последний год и почему самое время начинать его использовать.","id":"vladimir_ulyanov","name":"State of Vue (2k19 Q3)"},{"description":"Технический долг неизбежен, и зачастую он накапливается быстрее, чем мы успеваем его погашать. Особенно ярко это проблема проявляется, когда, поддавшись моде, мы стремимся внедрять новые технологии без предыдущего опыта их использования и наработанных практик и надеемся на дальнейший рефакторинг. Вместо ровной и стройной архитектуры у нас получается Tutorial Driven Development — демонстрационный код из документации библиотек становится основой для приложения.  Повышается зависимость от конкретных библиотек, нет четких правил написания кода и его стыковки со сторонним, высокоуровневый код переплетается с низкоуровневым. В докладе я расскажу об архитектуре, к которой пришел за четыре года разработки SPA и React Native приложений через свои пробы и ошибки и анализ и рефакторинг чужого кода.","id":"alexander_madyankin","name":"Как построить Гексагон: прагматичная архитектура для клиентских приложений"},{"description":"Мы привыкли, что написанные решения все делают за нас. В частности, преобразуют JS и CSS для поддержки старых браузеров. А если мы сталкиваемся с тем, что нет такого решения, которое нам нужно, то что делать? Спойлер - писать самим! При использовании css-переменных в styled-components мы столкнулись с таким вопросом. Основной проблемой для нас стала поддержка IE11, нам нужно было каким-то образом проставлять резервные свойства, но руками это делать не хотелось. Нам пришлось погрузиться в устройство синтаксических конструкций языка JavaScript. В этом докладе я хочу рассказать историю о том, как мы делали babel-плагин, реализующий обратную совместимость для css-переменных в styled-components.","id":"yana","name":"Поддержка старых браузеров в CSS-in-JS на AST-преобразованиях"}],"event":{"articles":[{"articleId":"schedule0","speakerId":null,"time":"10:00"},{"articleId":"schedule1","speakerId":null,"time":"11:00"},{"articleId":"alexander_korotaev","speakerId":"alexander_korotaev","time":"11:20"},{"articleId":"polina_gurtovaya","speakerId":"polina_gurtovaya","time":"12:00"},{"articleId":"schedule2","speakerId":null,"time":"12:40"},{"articleId":"yana","speakerId":"yana","time":"13:10"},{"articleId":"alexander_kanunnikov","speakerId":"alexander_kanunnikov","time":"13:50"},{"articleId":"schedule3","speakerId":null,"time":"14:30"},{"articleId":"nikolay_matvienko","speakerId":"nikolay_matvienko","time":"15:30"},{"articleId":"rustam_imaykin","speakerId":"rustam_imaykin","time":"15:45"},{"articleId":"alexey_zolotyh","speakerId":"alexey_zolotyh","time":"16:00"},{"articleId":"vladimir_ulyanov","speakerId":"vladimir_ulyanov","time":"16:15"},{"articleId":"paul_yuhnovich","speakerId":"paul_yuhnovich","time":"16:30"},{"articleId":"schedule4","speakerId":null,"time":"16:45"},{"articleId":"dmitry_patsura","speakerId":"dmitry_patsura","time":"17:15"},{"articleId":"alexander_madyankin","speakerId":"alexander_madyankin","time":"17:55"},{"articleId":"schedule5","speakerId":null,"time":"18:45"}]},"speakers":[{"firstName":"Александр","about":"Фронтенд-разработчик в Tinkoff.ru, делает игры дома и на работе. Отбирает доклады для HolyJS и активно помогает локальным фронтенд-сообществам Санкт-Петербурга.","id":"alexander_korotaev","lastName":"Коротаев","photo":{"alt":"Александр Коротаев","src":"/speaker/alexander_korotaev.jpg"},"socials":[{"link":"https://twitter.com/mamu_eval","name":"TWITTER"},{"link":"https://github.com/lekzd","name":"GITHUB"}]},{"firstName":"Дмитрий","about":"Разработчик, 9 лет опыта, работает на должности Complex Engineer в компании Fintier, специализирующейся на разработке маркетплейса, предоставляющего финансовые сервисы и принимающего платежи по всему миру.","id":"dmitry_patsura","lastName":"Пацура","photo":{"alt":"Дмитрий Пацура","src":"/speaker/dmitry_patsura.jpg"},"socials":[{"link":"https://twitter.com/ovrweb","name":"TWITTER"},{"link":"https://github.com/ovr","name":"GITHUB"}]},{"firstName":"Александр","about":"Лид-Синьор-Помидор, опенсорс контрибьютор, создатель AsynсDom, организатор Ember.JS митапов, иногда интересный докладчик, пишет SPA приложения 7 лет.","id":"alexander_kanunnikov","lastName":"Канунников","photo":{"alt":"Александр Канунников","src":"/speaker/alexander_kanunnikov.jpg"},"socials":[{"link":"https://twitter.com/vaier","name":"TWITTER"},{"link":"https://github.com/lifeart","name":"GITHUB"}]},{"firstName":"Алексей","about":"Пишет на JavaScript c 2007 года. До перехода к JS работал верстальщиком, сверстал более 100 сайтов. Писал на jQuery, Backbone.js, Angular 1, Angular 2, React, Ext JS, PolymerJS. Любит пользовательские интерфейсы и кофе.","id":"alexey_zolotyh","lastName":"Золотых","photo":{"alt":"Алексей Золотых","src":"/speaker/alexey_zolotyh.jpg"},"socials":[{"link":"https://twitter.com/zolotyh","name":"TWITTER"},{"link":"https://github.com/zolotyh","name":"GITHUB"}]},{"firstName":"Рустам","about":"Был увлечен веб (wap) разработкой с момента появления кнопочных телефонов, на тех же самых кнопочных телефонах (в редакторе 128px на 128px). Пишу на typescript, часть своей жизни посвящаю разработке на Angular. Веду канал t.me/ngFanatic","id":"rustam_imaykin","lastName":"Имайкин","photo":{"alt":"Рустам Имайкин","src":"/speaker/rustam_imaykin.jpg"},"socials":[{"link":"https://twitter.com/irustm","name":"TWITTER"},{"link":"https://github.com/irustm","name":"GITHUB"}]},{"firstName":"Павел","about":"Лид-сеньор-помидор, организатор всяких айтишных митапов и конференций, причастен к BeerJS  Минск и BeerJS Summit , со-ведущий развлекательного фронтенд ток шоу FrontSpot Show.","id":"paul_yuhnovich","lastName":"Юхнович","photo":{"alt":"Павел Юхнович","src":"/speaker/paul_yuhnovich.jpeg"},"socials":[{"link":"https://twitter.com/paul_yuhnovich","name":"TWITTER"},{"link":"https://medium.com/@Paul_Yuhnovich","name":"MEDIUM"}]},{"firstName":"Николай","about":"Инженер и эксперт по Node.js в Grid Dynamics. Большой фанат оптимизаций производительности Node.js приложений и облачных вычислений. Николай работает в США и в России, и часто путешествует по миру с докладами, основанными на профессиональном опыте проектов в области производительности, масштабируемости и разработки приложений. Сейчас он работает в Санкт-Петербурге, штат Флорида. Вместе с командой AWS он создает платформу облачных вычислений для одной из крупнейших IT компаний в США.","id":"nikolay_matvienko","lastName":"Матвиенко","photo":{"alt":"Николай Матвиенко","src":"/speaker/nikolay_matvienko.jpg"},"socials":[{"link":"https://twitter.com/matvi3nko","name":"TWITTER"},{"link":"https://github.com/matvi3nko","name":"GITHUB"}]},{"firstName":"Полина","about":"Занимается фронтом больше пяти лет. Последние 2 года в Марсианах. За это время Полина прокачала чувство прекрасного и умение изобретать велосипеды, но понимает, что находится только в начале пути. В свободное время пишет статьи, выступает, экспериментирует с ML/WebGL/GraphQL и воспитывает аквариумную рыбку :)","id":"polina_gurtovaya","lastName":"Гуртовая","photo":{"alt":"Полина Гуртовая","src":"/speaker/polina_gurtovaya.jpg"},"socials":[{"link":"https://github.com/HellSquirrel","name":"GITHUB"}]},{"firstName":"Владимир","about":"Любит красивые, удобные, производительные интерфейсы. Занимается UI разработкой, на досуге программирует на golang и поддерживает kubernetes-кластер.","id":"vladimir_ulyanov","lastName":"Ульянов","photo":{"alt":"Владимир Ульянов","src":"/speaker/vladimir_ulyanov.jpg"},"socials":[{"link":"https://twitter.com/lionskape","name":"TWITTER"},{"link":"https://t.me/lionskape","name":"TELEGRAM"}]},{"firstName":"Александр","about":"Фронтенд-тимлид в Злых Марсианах. Последние четыре года разрабатывает SPA и React Native приложения. За это время Александр успел поработать над веб-приложением для заказа такси для Gett, мобильными приложениями Amplifr (аналитика и публикация в социальные сети), Podium (cбор обратной связи для оффлайн-бизнесов), Connect By Common и Kin (приложения для сообщества съемщиков жилья в США).","id":"alexander_madyankin","lastName":"Мадьянкин","photo":{"alt":"Александр Мадьянкин","src":"/speaker/alexander_madyankin.jpg"},"socials":[{"link":"https://twitter.com/madyankin","name":"TWITTER"},{"link":"https://github.com/outpunk","name":"GITHUB"}]},{"firstName":"Яна","about":"Разрабатывает frontend уже 5 лет, нравятся интересные и нестандартные задачи.","id":"yana","lastName":"Менемчиадис","photo":{"alt":"Яна Менемчиадис","src":"/speaker/yana.jpg"},"socials":[{"link":"https://t.me/Iv_Me","name":"TELEGRAM"}]}]}}}